import { language, ln, dir } from './language'

export const getProvinceName = (provinceId) => {
  if (!provinceId || isNaN(Number(provinceId))) {
    return "222"
  }
  let province = cities.filter(item => item['id'] == Number(provinceId))
  console.log('province:', JSON.stringify(province[0].provinceName), language.key)
  return province[0].provinceName[language.key]
}

export const cities = [
  { id: 0, provinceName: "", citiesName: [] },
  { id: 1, provinceName: {fa: "آذربایجان شرقی", en: "Azerbaijan, East"}, citiesName: ["", "آذرشهر", "اسکو", "اهر", "بستان‌آباد", "بناب", "تبریز", "جلفا", "چاراویماق", "سراب", "شبستر", "عجب‌شیر", "کلیبر", "مراغه", "مرند", "ملکان", "میانه", "ورزقان", "هریس", "هشترود"] },
  { id: 2, provinceName: {fa: "آذربایجان غربی", en: "Azerbaijan, West"}, citiesName: ["", "ارومیه", "اشنویه", "بوکان", "پیرانشهر", "تکاب", "چالدران", "خوی", "سردشت", "سلماس", "شاهین‌دژ", "ماکو", "مهاباد", "میاندوآب", "نقده"] },
  { id: 3, provinceName: {fa: "اردبیل", en: "Ardabil"}, citiesName: ["", "اردبیل", "بیله‌سوار", "پارس‌آباد", "خلخال", "کوثر", "گِرمی", "مِشگین‌شهر", "نَمین", "نیر", "جعفرآباد", "کیوی",  "انبران", "آبي بيگلو‎", "هشجين‎", "اصلاندوز‎", "لاهرود‎", "كلور‎", "رضي‎", "تازه كندانگوت‎", "", "", "", "", "", "", "",] },
  { id: 4, provinceName: {fa: "اصفهان", en: "Isfahan"}, citiesName: ["", "آران و بیدگل", "اردستان", "اصفهان", "برخوار و میمه", "تیران و کرون", "چادگان", "خمینی‌شهر", "خوانسار", "سمیرم", "شهرضا", "سمیرم سفلی", "فریدن", "فریدون‌شهر", "فلاورجان", "کاشان", "گلپایگان", "لنجان", "مبارکه", "نائین", "نجف‌آباد", "نطنز"] },
  { id: 5, provinceName: {fa: "البرز", en: "Alborz"}, citiesName:["" , "نظرآباد", "کرج", "محمدشهر", "کمال‌شهر", "هشتگرد", "ماهدشت", "گرمدره", "گلسر", "کوهسر", "چهارباغ", "طالقان", "آسارا", "اشتهارد", "فردیس", "مشکین‌دشت", ] },
  { id: 6, provinceName: {fa: "ایلام", en: "Ilam"}, citiesName: ["", "آبدانان", "ایلام", "ایوان", "دره‌شهر", "دهلران", "شیروان و چرداول", "مهران"] },
  { id: 7, provinceName: {fa: "بوشهر", en: "Bushehr"}, citiesName: ["", "بوشهر", "تنگستان", "جم", "دشتستان", "دشتی", "دیر", "دیلم", "کنگان", "گناوه", "برازجان‎", "خورموج‎",] },
  { id: 8, provinceName: {fa: "تهران", en: "Tehran"}, citiesName: ["", "اسلام‌شهر", "پاکدشت", "تهران", "دماوند", "رباط‌کریم", "ری", "ساوجبلاغ", "شمیرانات", "شهریار", "فیروزکوه", "ورامین"] },
  { id: 9, provinceName: {fa: "چهارمحال و بختیاری", en: "Chahar Mahaal and Bakhtiari"}, citiesName: ["", "اردل", "بروجن", "شهرکرد", "فارسان", "کوهرنگ", "لردگان"] },
  { id: 10, provinceName: {fa: "خراسان جنوبی", en: "Khorasan, South"}, citiesName: ["", "بیرجند", "درمیان", "سرایان", "سربیشه", "فردوس", "قائنات", "نهبندان"] },
  { id: 11, provinceName: {fa: "خراسان رضوی", en: "Khorasan, Razavi"}, citiesName: ["", "بردسکن", "تایباد", "تربت جام", "تربت حیدریه", "چناران", "خلیل‌آباد", "خواف", "درگز", "رشتخوار", "سبزوار", "سرخس", "فریمان", "قوچان", "کاشمر", "کلات", "گناباد", "مشهد", "مه ولات", "نیشابور"] },
  { id: 12, provinceName: {fa: "خراسان شمالی", en: "Khorasan, North"}, citiesName: ["", "اسفراین", "بجنورد", "جاجرم", "شیروان", "فاروج", "مانه و سملقان"] },
  { id: 13, provinceName: {fa: "خوزستان", en: "Khuzestan"}, citiesName: ["", "آبادان", "امیدیه", "اندیمشک", "اهواز", "ایذه", "باغ‌ملک", "بندر ماهشهر", "بهبهان", "خرمشهر", "دزفول", "دشت آزادگان", "رامشیر", "رامهرمز", "شادگان", "شوش", "شوشتر", "گتوند", "لالی", "مسجد سلیمان", "هندیجان "] },
  { id: 14, provinceName: {fa: "زنجان", en: "Zanjan"}, citiesName: ["", "ابهر", "ایجرود", "خدابنده", "خرمدره", "زنجان", "طارم", "ماه‌نشان"] },
  { id: 15, provinceName: {fa: "سمنان", en: "Semnan"}, citiesName: ["", "دامغان", "سمنان", "شاهرود", "گرمسار", "مهدی‌شهر"] },
  { id: 16, provinceName: {fa: "سیستان و بلوچستان", en: "Sistan and Baluchestan"}, citiesName: ["", "ایرانشهر", "چابهار", "خاش", "دلگان", "زابل", "زاهدان", "زهک", "سراوان", "سرباز", "کنارک", "نیک‌شهر"] },
  { id: 17, provinceName: {fa: "فارس", en: "Fars"}, citiesName: ["", "آباده", "ارسنجان", "استهبان", "اقلید", "بوانات", "پاسارگاد", "جهرم", "خرم‌بید", "خنج", "داراب", "زرین‌دشت", "سپیدان", "شیراز", "فراشبند", "فسا", "فیروزآباد", "قیر و کارزین", "کازرون", "لارستان", "لامِرد", "مرودشت", "ممسنی", "مهر", "نی‌ریز"] },
  { id: 18, provinceName: {fa: "قزوین", en: "Qazvin"}, citiesName: ["", "آبیک", "البرز", "بوئین‌زهرا", "تاکستان", "قزوین"] },
  { id: 19, provinceName: {fa: "قم", en: "Qom"}, citiesName: ["", "قم"] },
  { id: 20, provinceName: {fa: "کردستان", en: "Kurdistan"}, citiesName: ["", "بانه", "بیجار", "دیواندره", "سروآباد", "سقز", "سنندج", "قروه", "کامیاران", "مریوان"] },
  { id: 21, provinceName: {fa: "کرمان", en: "Kerman"}, citiesName: ["", "بافت", "بردسیر", "بم", "جیرفت", "راور", "رفسنجان", "رودبار جنوب", "زرند", "سیرجان", "شهر بابک", "عنبرآباد", "قلعه گنج", "کرمان", "کوهبنان", "کهنوج", "منوجان"] },
  { id: 22, provinceName: {fa: "کرمانشاه", en: "Kermanshah"}, citiesName: ["", "اسلام‌آباد غرب", "پاوه", "ثلاث باباجانی", "جوانرود", "دالاهو", "روانسر", "سرپل ذهاب", "سنقر", "صحنه", "قصر شیرین", "کرمانشاه", "کنگاور", "گیلان غرب", "هرسین"] },
  { id: 23, provinceName: {fa: "کهگیلویه و بویراحمد", en: "Kohgiluyeh and Boyer-Ahmad"}, citiesName: ["", "بویراحمد", "بهمئی", "دنا", "کهگیلویه", "گچساران"] },
  { id: 24, provinceName: {fa: "گلستان", en: "Golestan"}, citiesName: ["", "آزادشهر", "آق‌قلا", "بندر گز", "ترکمن", "رامیان", "علی‌آباد", "کردکوی", "کلاله", "گرگان", "گنبد کاووس", "مراوه‌تپه", "مینودشت"] },
  { id: 25, provinceName: {fa: "گیلان", en: "Gilan"}, citiesName: ["", "آستارا", "آستانه اشرفیه", "اَملَش", "بندر انزلی", "رشت", "رضوانشهر", "رودبار", "رودسر", "سیاهکل", "شَفت", "صومعه‌سرا", "طوالش", "فومَن", "لاهیجان", "لنگرود", "ماسال"] },
  { id: 26, provinceName: {fa: "لرستان", en: "Lorestan"}, citiesName: ["", "ازنا", "الیگودرز", "بروجرد", "پل‌دختر", "خرم‌آباد", "دورود", "دلفان", "سلسله", "کوهدشت"] },
  { id: 27, provinceName: {fa: "مازندران", en: "Mazandaran"}, citiesName: ["", "آمل", "بابل", "بابلسر", "بهشهر", "تنکابن", "جویبار", "چالوس", "رامسر", "ساری", "سوادکوه", "قائم‌شهر", "گلوگاه", "محمودآباد", "نکا", "نور", "نوشهر"] },
  { id: 28, provinceName: {fa: "مرکزی", en: "Markazi"}, citiesName: ["", "آشتیان", "اراک", "تفرش", "خمین", "دلیجان", "زرندیه", "ساوه", "شازند", "کمیجان", "محلات"] },
  { id: 29, provinceName: {fa: "هرمزگان", en: "Hormozgān"}, citiesName: ["", "ابوموسی", "بستک", "بندر عباس", "بندر لنگه", "جاسک", "حاجی‌آباد", "شهرستان خمیر", "رودان ", "قشم", "گاوبندی", "میناب"] },
  { id: 30, provinceName: {fa: "همدان", en: "Hamadan"}, citiesName: ["", "اسدآباد", "بهار", "تویسرکان", "رزن", "کبودرآهنگ", "ملایر", "نهاوند", "همدان"] },
  { id: 31, provinceName: {fa: "یزد", en: "Yazd"}, citiesName: ["", "ابرکوه", "اردکان", "بافق", "تفت", "خاتم", "صدوق", "طبس", "مهریز", "مِیبُد", "یزد"] },
]
